Tekla.Structures.DirectManipulation.Adapter.Interaction.HandleBitmapLoader
The Tekla.Structures.DirectManipulation.Adapter.Interaction.HandleBitmapLoader class loads all bitmaps used for visualizing point handles.

Tekla.Structures.DirectManipulation.Adapter.Interaction.HandleBitmapLoader.bitmaps
The collection of already loaded bitmaps.

Tekla.Structures.DirectManipulation.Adapter.Interaction.HandleBitmapLoader.#ctor
Initializes a new instance of the Tekla.Structures.DirectManipulation.Adapter.Interaction.HandleBitmapLoader class.

Tekla.Structures.DirectManipulation.Adapter.Interaction.HandleBitmapLoader.Get(Tekla.Structures.DirectManipulation.Adapter.Interaction.HandleGraphicDescription,Tekla.Structures.DirectManipulation.Adapter.Interaction.HandleBitmapLoader.BitmapTargetType)
Gets the bitmap for the specified type of handle graphic.
type: The type of handle graphic to get a bitmap for.
bitmapTargetType: The target type of bitmap.
Returns: The bitmap.

Tekla.Structures.DirectManipulation.Adapter.Interaction.HandleBitmapLoader.DotExportCreateDmBitmap(Tekla.Structures.DirectManipulation.Adapter.Interaction.HandleBitmapLoader.BitmapTargetType,Tekla.Structures.DirectManipulation.Adapter.Interaction.Native.dotBitmap_t@)
Loads the bitmap of a handle on TS core side.
type: The target type of the bitmap.
bitmap: The bitmap.
Returns: Greater than 0 on success.

Tekla.Structures.DirectManipulation.Adapter.Interaction.HandleBitmapLoader.LoadNativeBitmap(Tekla.Structures.DirectManipulation.Adapter.Interaction.HandleGraphicDescription,Tekla.Structures.DirectManipulation.Adapter.Interaction.HandleBitmapLoader.BitmapTargetType)
Loads the Tekla.Structures.DirectManipulation.Adapter.Interaction.Native.dotBitmap_t for the given Tekla.Structures.DirectManipulation.Adapter.Interaction.HandleGraphicDescription.
graphicDescription: The description of the handle to load the bitmap for.
bitmapTargetType: The type of the bitmap.
Returns: A native bitmap to use for graphicDescription, or the default of Tekla.Structures.DirectManipulation.Adapter.Interaction.Native.dotBitmap_t if not found.

Tekla.Structures.DirectManipulation.Adapter.Interaction.HandleBitmapLoader.LoadBitmap(System.Drawing.Bitmap,Tekla.Structures.DirectManipulation.Adapter.Interaction.HandleBitmapLoader.BitmapTargetType,System.String)
Loads a Tekla.Structures.DirectManipulation.Adapter.Interaction.Native.dotBitmap_t from TS core.
bitmap: Bitmap to load.
targetType: Type of the target bitmap.
bitmapName: Bitmap name.
Returns:

Tekla.Structures.DirectManipulation.Adapter.Interaction.HandleBitmapLoader.LoadNativeBitmap(System.String,Tekla.Structures.DirectManipulation.Adapter.Interaction.HandleBitmapLoader.BitmapTargetType)
Loads a Tekla.Structures.DirectManipulation.Adapter.Interaction.Native.dotBitmap_t from the specified bitmapName resource.
bitmapName: The name of the resource to load.
targetType: Type of the target bitmap.
Returns:
A native bitmap loaded from bitmapName,
or the default of Tekla.Structures.DirectManipulation.Adapter.Interaction.Native.dotBitmap_t if the file doesn't exist.

Tekla.Structures.DirectManipulation.Adapter.Interaction.HandleBitmapLoader.TryGetBitmapResourse(System.String)
Tries to get the resource of the specified bitmapName.
bitmapName: The name of the resource to load.
Returns: The bitmap resource for bitmapName, or null the file does not exists.

Tekla.Structures.DirectManipulation.Adapter.Interaction.HandleBitmapLoader.GetFileNameStringPart(Tekla.BIM.DirectManipulation.Services.Interaction.HandleLocationType)
Gets the part of the bitmap filename associated to locationType.
locationType: The value to get the filename's part for.
Returns: A part of a bitmap's filename.

Tekla.Structures.DirectManipulation.Adapter.Interaction.HandleBitmapLoader.GetFileNameStringPart(Tekla.BIM.DirectManipulation.Services.Interaction.HandleTargetType)
Gets the part of the bitmap filename associated to targetType.
targetType: The value to get the filename's part for.
Returns: A part of a bitmap's filename.

Tekla.Structures.DirectManipulation.Adapter.Interaction.HandleBitmapLoader.GetFileNameStringPart(Tekla.BIM.DirectManipulation.Services.Interaction.InteractionState)
Gets the part of the bitmap filename associated to state.
state: The value to get the filename's part for.
Returns: A part of a bitmap's filename.